package kr.rabbito.shuttlelocationproject.data

import com.google.android.gms.maps.model.LatLng

val tuk_route = arrayOf(
    LatLng(37.337272, 126.736072),
    LatLng(37.340786, 126.730372),
    LatLng(37.343790, 126.733322),
    LatLng(37.345289, 126.734745),
    LatLng(37.347356, 126.736804),
    LatLng(37.351476, 126.740745),
    LatLng(37.350695, 126.743040),
    LatLng(37.350127, 126.744053),
    LatLng(37.350846, 126.744857),
    LatLng(37.351964, 126.740970),
    LatLng(37.351479, 126.740708),
    LatLng(37.345314, 126.734715),
    LatLng(37.343799, 126.733277),
    LatLng(37.340248, 126.738970),
    LatLng(37.337272, 126.736072)
)
// 정왕 -> 제 1 캠퍼스
val tuk_route_up = arrayOf(
    LatLng(37.351863, 126.741314),
    LatLng(37.351964, 126.740970),
    LatLng(37.351479, 126.740708),
    LatLng(37.345314, 126.734715),
    LatLng(37.343799, 126.733277),
    LatLng(37.340248, 126.738970),
    LatLng(37.337272, 126.736072),
    LatLng(37.339503, 126.732489)
)
// 제 1 캠퍼스 -> 정왕
val tuk_route_down = arrayOf(
    LatLng(37.339503, 126.732489),
    LatLng(37.340786, 126.730372),
    LatLng(37.343790, 126.733322),
    LatLng(37.345289, 126.734745),
    LatLng(37.347356, 126.736804),
    LatLng(37.351476, 126.740745),
    LatLng(37.350695, 126.743040),
    LatLng(37.350127, 126.744053),
    LatLng(37.350846, 126.744857),
    LatLng(37.351863, 126.741314)
)
